tap 'borkdude/brew'
tap "clojure/tools"
tap "homebrew/services"
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'neovim/neovim'

# Shell & CLI Tools
brew 'fish'
brew 'fzf'
brew 'zsh'

# File & Text Search
brew 'bat'
brew 'fd'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'eza'
brew 'yazi'

# Development Tools
brew 'cloc'
brew 'clojure'
brew 'difftastic'
brew 'flow'
brew 'git', args: ['without-completions']
brew 'git-flow-avh'
brew 'gradle'
brew 'jq'
brew 'lua'
brew 'luarocks'
brew 'maven'
brew 'neovim'
brew 'nginx'
brew 'node'
brew 'peco'
brew 'planck'
brew 'postgresql'
brew 'python'
brew 'pyenv'
brew 'pipx'
brew 'redis'
brew 'rename'
brew 'rlwrap'
brew 'rsync'
brew 'ruby'
brew 'sshpass'
brew 'tldr'
brew 'tree'
brew 'vnstat'
brew 'watchexec'
brew 'watchman'
brew 'wget'
brew 'yarn'

# Media & Utilities
brew 'cmus'
brew 'ffmpeg'
brew 'exiftool'
brew 'gallery-dl'
brew 'yt-dlp'

# Cloud & DevOps
brew 'awscli'

# Security
brew 'bitwarden-cli'

# System Utilities
brew 'restic'
brew 'switchaudio-osx'
brew 'terminal-notifier'
brew 'yabai'

brew 'borkdude/brew/babashka'
brew 'borkdude/brew/clj-kondo'

# Applications
cask 'android-platform-tools'
cask 'bitwarden'
cask 'blackhole-2ch'
cask 'claude-code'
cask 'deluge'
cask 'ghostty'
cask 'hammerspoon'
cask 'iterm2@beta'
cask 'karabiner-elements'
cask 'kitty'
cask 'stats'
cask 'xquartz'
