tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/x11'
tap 'neovim/neovim'
tap 'railwaycat/emacsmacport'
tap 'rogual/neovim-dot-app'
brew 'autoconf'
brew 'xz'
brew 'automake'
brew 'bash-completion'
brew 'cmake'
brew 'openssl'
brew 'geoip'
brew 'bro'
brew 'cmatrix'
brew 'cscope'
brew 'pkg-config'
brew 'emacs'
brew 'entr'
brew 'gdbm'
brew 'gettext'
brew 'pcre'
brew 'git', args: ['without-completions']
brew 'git-flow'
brew 'gmp'
brew 'haskell-stack'
brew 'leiningen'
brew 'libevent'
brew 'libtool'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'macvim'
brew 'markdown'
brew 'maven'
brew 'scons'
brew 'mongodb'
brew 'msgpack'
brew 'nginx'
brew 'node'
brew 'planck'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'rlwrap'
brew 'the_silver_searcher'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'caskroom/cask/brew-cask'
brew 'homebrew/x11/swi-prolog'
brew 'neovim/neovim/neovim'
brew 'railwaycat/emacsmacport/emacs-mac'
brew 'rogual/neovim-dot-app/neovim-dot-app', args: ['HEAD']
