tap 'borkdude/brew'
tap "clojure/tools"
tap "homebrew/services"
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'neovim/neovim'

brew 'bat'
brew 'cloc'
brew 'clojure'
brew 'cmus'
brew 'ffmpeg'
brew 'flow'
brew 'git', args: ['without-completions']
brew 'git-flow-avh'
brew 'gradle'
brew 'jq'
brew 'lua'
brew 'luarocks'
brew 'maven'
brew 'neovim'
brew 'nginx'
brew 'node@12'
brew 'peco'
brew 'planck'
brew 'postgresql'
brew 'python'
brew 'redis'
brew 'rename'
brew 'rlwrap'
brew 'rsync'
brew 'ruby'
brew 'sshpass'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tree'
brew 'vnstat'
brew 'watchexec'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'

brew 'borkdude/brew/babashka'
brew 'borkdude/brew/clj-kondo'

cask 'deluge'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner'
cask 'karabiner-elements'
cask 'xquartz'
